# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [3]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [4]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [5]:
pdlst = pd.Series(lst)
print(pdlst)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [6]:
print(pdlst[2])

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
df_b = pd.DataFrame(b)
print(df_b)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [9]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [10]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [11]:
df_b.columns = colnames
print(df_b)

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [12]:
df_b_sub = df_b[['Score_1', 'Score_3', 'Score_5']]
print(df_b_sub)

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [13]:
df_b.Score_3.mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [14]:
df_b.Score_4.max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [15]:
df_b.Score_2.median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [16]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [17]:
df_orders = pd.DataFrame(orders)
df_orders.sample()

                   Description  Quantity  UnitPrice  Revenue
2  RIBBON REEL STRIPES DESIGN          1       1.65     1.65

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [18]:
Total_orders = df_orders.Quantity.sum()
print(Total_orders)

2978

In [19]:
Total_revenue = df_orders.Revenue.sum()
print(Total_revenue)

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [20]:
expensive = df_orders.UnitPrice.max()
print(expensive)

11.95

In [21]:
cheapest = df_orders.UnitPrice.min()
print(cheapest)

0.18

In [22]:
diff = df_orders.UnitPrice.max()-df_orders.UnitPrice.min()
print(diff)

11.77

## Let's load another dataset for more exercisesº

In [23]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [24]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [25]:
admissions.info() #385 entradas, 385 no nullas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 27.2 KB

In [26]:
admissions.isna().sum() #No hay NaN en mi df

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [30]:
admissions.set_index("Serial No.", drop=False, inplace=True)

In [ ]:
admissions

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [32]:
admissions.set_index("GRE Score", drop=False)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
GRE Score,,,,,,,,,
337,1,337,118,4,4.5,4.5,9.65,1,0.92
316,2,316,104,3,3.0,3.5,8.00,1,0.72
322,3,322,110,3,3.5,2.5,8.67,1,0.80
314,4,314,103,2,2.0,3.0,8.21,0,0.65
330,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
324,381,324,110,3,3.5,3.5,9.04,1,0.82
325,382,325,107,3,3.0,3.5,9.11,1,0.84
330,383,330,116,4,5.0,4.5,9.45,1,0.91
312,384,312,103,3,3.5,4.0,8.78,0,0.67
333,385,333,117,4,5.0,4.0,9.66,1,0.95

In [40]:
admissions.set_index("CGPA", drop=False)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
CGPA,,,,,,,,,
9.65,1,337,118,4,4.5,4.5,9.65,1,0.92
8.00,2,316,104,3,3.0,3.5,8.00,1,0.72
8.67,3,322,110,3,3.5,2.5,8.67,1,0.80
8.21,4,314,103,2,2.0,3.0,8.21,0,0.65
9.34,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
9.04,381,324,110,3,3.5,3.5,9.04,1,0.82
9.11,382,325,107,3,3.0,3.5,9.11,1,0.84
9.45,383,330,116,4,5.0,4.5,9.45,1,0.91
8.78,384,312,103,3,3.5,4.0,8.78,0,0.67
9.66,385,333,117,4,5.0,4.0,9.66,1,0.95

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [77]:
# Preguntar, no se que estoy poniendo mal
#admissions_CGPA_inves = admissions.apply(lambda fila : f"{fila['CGPA']},{fila['Research']}" if fila["CGPA"]>9 & fila["Research"] == 1, axis = 1)
admissions.Research.unique()

array([1, 0])

In [73]:
admissions[(admissions.CGPA>9) & (admissions.Research == 1)].head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
5,5,330,115,5,4.5,3.0,9.34,1,0.90
11,11,328,112,4,4.0,4.5,9.10,1,0.78
20,20,328,116,5,5.0,5.0,9.50,1,0.94
21,21,334,119,5,5.0,4.5,9.70,1,0.95

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [74]:
admissions_filt2 = admissions.loc [(admissions["CGPA"]>9) & (admissions["SOP"]< 3.5)] 
admissions_filt2.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
29,29,338,118,4,3.0,4.5,9.40,1,0.91
63,63,327,114,3,3.0,3.0,9.02,0,0.61
141,141,326,114,3,3.0,3.0,9.11,1,0.83
218,218,324,111,4,3.0,3.0,9.01,1,0.82
382,382,325,107,3,3.0,3.5,9.11,1,0.84

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [97]:
def TOEFL (x):
    if x > 100:
        return True
    else:
        return False
    
admissions["toefl_filt"] = list(admissions_filt["TOEFL Score"].apply(TOEFL)) # Casteo a lista para añadirlo como columna del tiron
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision,toefl_filt
Serial No.,,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,True,True
2,2,316,104,3,3.0,3.5,8.00,1,0.72,True,True
3,3,322,110,3,3.5,2.5,8.67,1,0.80,True,True
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True,True
5,5,330,115,5,4.5,3.0,9.34,1,0.90,True,True
...,...,...,...,...,...,...,...,...,...,...,...
381,381,324,110,3,3.5,3.5,9.04,1,0.82,True,True
382,382,325,107,3,3.0,3.5,9.11,1,0.84,True,True
383,383,330,116,4,5.0,4.5,9.45,1,0.91,True,True
384,384,312,103,3,3.5,4.0,8.78,0,0.67,True,True
385,385,333,117,4,5.0,4.0,9.66,1,0.95,True,True

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [98]:
admissions["Decision"] = list(admissions_filt["TOEFL Score"].apply(TOEFL))

admissions.drop(columns="toefl_filt", inplace=True)
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision
Serial No.,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,True
2,2,316,104,3,3.0,3.5,8.00,1,0.72,True
3,3,322,110,3,3.5,2.5,8.67,1,0.80,True
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True
5,5,330,115,5,4.5,3.0,9.34,1,0.90,True

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [105]:
def SOP(x):
    if x>3:
        return 1
    else:
        return 0
decision2 = admissions_filt.SOP.apply(SOP)
admissions_filt["decision2"] = list(decision2)
admissions_filt.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,decision2
Serial No.,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,1
2,2,316,104,3,3.0,3.5,8.00,1,0.72,0
3,3,322,110,3,3.5,2.5,8.67,1,0.80,1
4,4,314,103,2,2.0,3.0,8.21,0,0.65,0
5,5,330,115,5,4.5,3.0,9.34,1,0.90,1